## Cumulative or Moving Aggregations

Let us understand how we can take care of cumulative or moving aggregations using Analytic Functions.

* When it comes to Windowing or Analytic Functions we can also specify window spec using `ROWS BETWEEN` clause.
* Even when we do not specify window spec, the default window spec is used. For most of the functions the default window spec is `UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING`. You also have special clauses such as `CURRENT ROW`.
* Here are some of the examples with respect to `ROWS BETWEEN`.
  * `ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING`
  * `ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW`
  * `ROWS BETWEEN CURRENT ROW AND UNBOUNDED FOLLOWING`
  * `ROWS BETWEEN 3 PRECEDING AND CURRENT ROW` - moving aggregations using current record and previous 3 records.
  * `ROWS BETWEEN CURRENT ROW AND 3 FOLLOWING` - moving aggregations using current record and following 3 records.
  * `ROWS BETWEEN 3 PRECEDING AND 3 FOLLOWING` - moving aggregations based up on 7 records (current record, 3 previous records and 3 following records)
* We can leverage `ROWS BETWEEN` for cumulative aggregations or moving aggregations.
* Here is an example of cumulative sum.

```{warning}
If you are using Jupyter based environment make sure to restart the kernel, as the session might have been already connected with retail database.
```

In [1]:
%load_ext sql

In [2]:
%env DATABASE_URL=postgresql://itversity_hr_user:hr_password@localhost:5432/itversity_hr_db

env: DATABASE_URL=postgresql://itversity_hr_user:hr_password@localhost:5432/itversity_hr_db

```{note}
Even though it is not mandatory to specify `ORDER BY` as per syntax for cumulative aggregations, it is a must to specify. If not, you will end up getting incorrect results.
```

In [3]:
%%sql

SELECT e.employee_id, e.department_id, e.salary,
    sum(e.salary) OVER (
        PARTITION BY e.department_id
        ORDER BY e.salary
        ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW
    ) AS sum_sal_expense
FROM employees e
ORDER BY e.department_id, e.salary DESC
LIMIT 10

10 rows affected.

[(200, 10, Decimal('4400.00'), Decimal('4400.00')),
 (201, 20, Decimal('13000.00'), Decimal('19000.00')),
 (202, 20, Decimal('6000.00'), Decimal('6000.00')),
 (114, 30, Decimal('11000.00'), Decimal('24900.00')),
 (115, 30, Decimal('3100.00'), Decimal('13900.00')),
 (116, 30, Decimal('2900.00'), Decimal('10800.00')),
 (117, 30, Decimal('2800.00'), Decimal('7900.00')),
 (118, 30, Decimal('2600.00'), Decimal('5100.00')),
 (119, 30, Decimal('2500.00'), Decimal('2500.00')),
 (203, 40, Decimal('6500.00'), Decimal('6500.00'))]

```{warning}
If you are using Jupyter based environment make sure to restart the kernel, as the session might have been already connected with hr database.
```

In [1]:
%load_ext sql

In [2]:
%env DATABASE_URL=postgresql://itversity_retail_user:retail_password@localhost:5432/itversity_retail_db

env: DATABASE_URL=postgresql://itversity_retail_user:retail_password@localhost:5432/itversity_retail_db

```{note}
Here is the example for cumulative sum for every month using daily_product_revenue in retail database.
```

In [3]:
%%sql

SELECT t.*,
    round(sum(t.revenue) OVER (
        PARTITION BY to_char(order_date, 'yyyy-MM')
        ORDER BY order_date
        ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW
    ), 2) AS cumulative_daily_revenue
FROM daily_revenue t
ORDER BY to_char(order_date, 'yyyy-MM'),
    order_date
LIMIT 10

10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), Decimal('31547.23'), Decimal('31547.23')),
 (datetime.datetime(2013, 7, 26, 0, 0), Decimal('54713.23'), Decimal('86260.46')),
 (datetime.datetime(2013, 7, 27, 0, 0), Decimal('48411.48'), Decimal('134671.94')),
 (datetime.datetime(2013, 7, 28, 0, 0), Decimal('35672.03'), Decimal('170343.97')),
 (datetime.datetime(2013, 7, 29, 0, 0), Decimal('54579.70'), Decimal('224923.67')),
 (datetime.datetime(2013, 7, 30, 0, 0), Decimal('49329.29'), Decimal('274252.96')),
 (datetime.datetime(2013, 7, 31, 0, 0), Decimal('59212.49'), Decimal('333465.45')),
 (datetime.datetime(2013, 8, 1, 0, 0), Decimal('49160.08'), Decimal('49160.08')),
 (datetime.datetime(2013, 8, 2, 0, 0), Decimal('50688.58'), Decimal('99848.66')),
 (datetime.datetime(2013, 8, 3, 0, 0), Decimal('43416.74'), Decimal('143265.40'))]

```{note}
Here are examples for 3 day moving sum as well as average using daily_revenue in retail database.
```

In [4]:
%%sql

SELECT t.*,
    round(sum(t.revenue) OVER (
        ORDER BY order_date
        ROWS BETWEEN 2 PRECEDING AND CURRENT ROW
    ), 2) AS moving_3day_revenue
FROM daily_revenue t
ORDER BY order_date
LIMIT 20

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
20 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), Decimal('31547.23'), Decimal('31547.23')),
 (datetime.datetime(2013, 7, 26, 0, 0), Decimal('54713.23'), Decimal('86260.46')),
 (datetime.datetime(2013, 7, 27, 0, 0), Decimal('48411.48'), Decimal('134671.94')),
 (datetime.datetime(2013, 7, 28, 0, 0), Decimal('35672.03'), Decimal('138796.74')),
 (datetime.datetime(2013, 7, 29, 0, 0), Decimal('54579.70'), Decimal('138663.21')),
 (datetime.datetime(2013, 7, 30, 0, 0), Decimal('49329.29'), Decimal('139581.02')),
 (datetime.datetime(2013, 7, 31, 0, 0), Decimal('59212.49'), Decimal('163121.48')),
 (datetime.datetime(2013, 8, 1, 0, 0), Decimal('49160.08'), Decimal('157701.86')),
 (datetime.datetime(2013, 8, 2, 0, 0), Decimal('50688.58'), Decimal('159061.15')),
 (datetime.datetime(2013, 8, 3, 0, 0), Decimal('43416.74'), Decimal('143265.40')),
 (datetime.datetime(2013, 8, 4, 0, 0), Decimal('35093.01'), Decimal('129198.33')),
 (datetime.datetime(2013, 8, 5, 0, 0), Decimal('34025.27'), Decimal('112535.02')),
 (datetime.datetime(2013, 8, 6, 0, 0), Decimal('57843.89'), Decimal('126962.17')),
 (datetime.datetime(2013, 8, 7, 0, 0), Decimal('45525.59'), Decimal('137394.75')),
 (datetime.datetime(2013, 8, 8, 0, 0), Decimal('33549.47'), Decimal('136918.95')),
 (datetime.datetime(2013, 8, 9, 0, 0), Decimal('29225.16'), Decimal('108300.22')),
 (datetime.datetime(2013, 8, 10, 0, 0), Decimal('46435.04'), Decimal('109209.67')),
 (datetime.datetime(2013, 8, 11, 0, 0), Decimal('31155.50'), Decimal('106815.70')),
 (datetime.datetime(2013, 8, 12, 0, 0), Decimal('59014.74'), Decimal('136605.28')),
 (datetime.datetime(2013, 8, 13, 0, 0), Decimal('17956.88'), Decimal('108127.12'))]

In [5]:
%%sql

SELECT t.*,
    round(sum(t.revenue) OVER (
        ORDER BY order_date
        ROWS BETWEEN 2 PRECEDING AND 2 FOLLOWING
    ), 2) AS moving_3day_revenue
FROM daily_revenue t
ORDER BY order_date
LIMIT 20

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
20 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), Decimal('31547.23'), Decimal('134671.94')),
 (datetime.datetime(2013, 7, 26, 0, 0), Decimal('54713.23'), Decimal('170343.97')),
 (datetime.datetime(2013, 7, 27, 0, 0), Decimal('48411.48'), Decimal('224923.67')),
 (datetime.datetime(2013, 7, 28, 0, 0), Decimal('35672.03'), Decimal('242705.73')),
 (datetime.datetime(2013, 7, 29, 0, 0), Decimal('54579.70'), Decimal('247204.99')),
 (datetime.datetime(2013, 7, 30, 0, 0), Decimal('49329.29'), Decimal('247953.59')),
 (datetime.datetime(2013, 7, 31, 0, 0), Decimal('59212.49'), Decimal('262970.14')),
 (datetime.datetime(2013, 8, 1, 0, 0), Decimal('49160.08'), Decimal('251807.18')),
 (datetime.datetime(2013, 8, 2, 0, 0), Decimal('50688.58'), Decimal('237570.90')),
 (datetime.datetime(2013, 8, 3, 0, 0), Decimal('43416.74'), Decimal('212383.68')),
 (datetime.datetime(2013, 8, 4, 0, 0), Decimal('35093.01'), Decimal('221067.49')),
 (datetime.datetime(2013, 8, 5, 0, 0), Decimal('34025.27'), Decimal('215904.50')),
 (datetime.datetime(2013, 8, 6, 0, 0), Decimal('57843.89'), Decimal('206037.23')),
 (datetime.datetime(2013, 8, 7, 0, 0), Decimal('45525.59'), Decimal('200169.38')),
 (datetime.datetime(2013, 8, 8, 0, 0), Decimal('33549.47'), Decimal('212579.15')),
 (datetime.datetime(2013, 8, 9, 0, 0), Decimal('29225.16'), Decimal('185890.76')),
 (datetime.datetime(2013, 8, 10, 0, 0), Decimal('46435.04'), Decimal('199379.91')),
 (datetime.datetime(2013, 8, 11, 0, 0), Decimal('31155.50'), Decimal('183787.32')),
 (datetime.datetime(2013, 8, 12, 0, 0), Decimal('59014.74'), Decimal('196605.61')),
 (datetime.datetime(2013, 8, 13, 0, 0), Decimal('17956.88'), Decimal('199737.25'))]

In [6]:
%%sql

SELECT t.*,
    round(avg(t.revenue) OVER (
        ORDER BY order_date
        ROWS BETWEEN 2 PRECEDING AND CURRENT ROW
    ), 2) AS moving_3day_revenue
FROM daily_revenue t
ORDER BY order_date
LIMIT 20

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
20 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), Decimal('31547.23'), Decimal('31547.23')),
 (datetime.datetime(2013, 7, 26, 0, 0), Decimal('54713.23'), Decimal('43130.23')),
 (datetime.datetime(2013, 7, 27, 0, 0), Decimal('48411.48'), Decimal('44890.65')),
 (datetime.datetime(2013, 7, 28, 0, 0), Decimal('35672.03'), Decimal('46265.58')),
 (datetime.datetime(2013, 7, 29, 0, 0), Decimal('54579.70'), Decimal('46221.07')),
 (datetime.datetime(2013, 7, 30, 0, 0), Decimal('49329.29'), Decimal('46527.01')),
 (datetime.datetime(2013, 7, 31, 0, 0), Decimal('59212.49'), Decimal('54373.83')),
 (datetime.datetime(2013, 8, 1, 0, 0), Decimal('49160.08'), Decimal('52567.29')),
 (datetime.datetime(2013, 8, 2, 0, 0), Decimal('50688.58'), Decimal('53020.38')),
 (datetime.datetime(2013, 8, 3, 0, 0), Decimal('43416.74'), Decimal('47755.13')),
 (datetime.datetime(2013, 8, 4, 0, 0), Decimal('35093.01'), Decimal('43066.11')),
 (datetime.datetime(2013, 8, 5, 0, 0), Decimal('34025.27'), Decimal('37511.67')),
 (datetime.datetime(2013, 8, 6, 0, 0), Decimal('57843.89'), Decimal('42320.72')),
 (datetime.datetime(2013, 8, 7, 0, 0), Decimal('45525.59'), Decimal('45798.25')),
 (datetime.datetime(2013, 8, 8, 0, 0), Decimal('33549.47'), Decimal('45639.65')),
 (datetime.datetime(2013, 8, 9, 0, 0), Decimal('29225.16'), Decimal('36100.07')),
 (datetime.datetime(2013, 8, 10, 0, 0), Decimal('46435.04'), Decimal('36403.22')),
 (datetime.datetime(2013, 8, 11, 0, 0), Decimal('31155.50'), Decimal('35605.23')),
 (datetime.datetime(2013, 8, 12, 0, 0), Decimal('59014.74'), Decimal('45535.09')),
 (datetime.datetime(2013, 8, 13, 0, 0), Decimal('17956.88'), Decimal('36042.37'))]